{
    "Intro": {
        "DownloadCV": "/images/CV.pdf",
        "introductionStatement": "Results-driven developer with 4 years of experience architecting and implementing scalable, user-focused web applications at Deloitte. Expertise in React, JavaScript, and modern frontend frameworks, with a proven record of delivering high-impact solutions on mission-critical projects. Recognized for technical leadership, accessibility compliance, and exceptional teamwork through multiple Deloitte SPOT and APPLAUSE awards. Adept at resolving complex UI/UX challenges, optimizing performance, and mentoring team members in fast-paced environments. Seeking to leverage deep React knowledge and a passion for innovation to contribute to ambitious product teams."
    },
    "Experiences": [
        {
            "Project Name": "NextGen Verification Hub",
            "Role": "FRONT END DEVELOPER - Deloitte",
            "Time Period": "JUL 2025 - PRESENT",
            "Description": "NextGen Verification Hub is a comprehensive eligibility verification system with dedicated Admin console and Customer Portal interfaces for managing benefits verification processes.",
            "Responsibilities": "<ul><li>Built 30+ admin and customer portal screens, setting up project structure and coding standards from the ground up.</li><li>Improved UI consistency and code quality by updating components to match latest FIGMA designs.</li><li>Created database tables and led backend development for new interface integrations.</li><li>Fixed 20+ bugs, increasing system reliability and performance across customer workflows.</li><li>Conducted performance tests and optimized file uploads to ensure smooth user experience.</li></ul>",
            "Tools Used": "React, JavaScript, HTML, CSS, PostgreSQL, FIGMA, Visual Studio Code, SourceTree, Postman, JIRA"
        },
        {
            "Project Name": "SC Customer Portal",
            "Role": "FRONT END DEVELOPER - Deloitte",
            "Time Period": "MAR 2025 - JUL 2025",
            "Description": "SCCP LIFT Customer Portal enabling citizens to apply for and manage social service benefits with integrated appeals functionality.",
            "Responsibilities": "<ul><li>Provided architectural guidance and rapid solutions for the SCCP project, including urgent delivery of demo login screens.</li><li>Transformed legacy code by converting class components to functional React components, enhancing scalability.</li><li>Delivered and integrated 20+ UI screens with backend functionality, and implemented Spanish translations for 20+ screens.</li><li>Performed codebase cleanup, reducing portal load times by 30%, and modularized code for improved usability and maintainability, contributing to a successful Appeals module launch.</li><li>Developed unit tests and maintained thorough documentation to support ongoing team deliverables.</li><li><strong>Awards:</strong> SCCP SPOT AWARD, APPLAUSE AWARD for outstanding module delivery and adaptability.</li></ul>",
            "Tools Used": "React, JavaScript, HTML, CSS, i18next, PostgreSQL, FIGMA, Visual Studio Code, Git, Postman, JIRA"
        },
        {
            "Project Name": "Michigan - Mobile & Accessibility",
            "Role": "FRONT END DEVELOPER - Deloitte",
            "Time Period": "JAN 2025 - MAR 2025",
            "Description": "Michigan SSP focused on enhancing mobile responsiveness and accessibility compliance for state benefits portal.",
            "Responsibilities": "<ul><li>Fixed 80+ mobile responsiveness defects and delivered 99% closure of 60+ ADA accessibility issues.</li><li>Optimized React UI by removing redundant DOM structures, improving page load speed by 30%, and fixing 60+ lint errors.</li><li><strong>Awards:</strong> APPLAUSE AWARD for technical excellence and support to SC/MI teams.</li></ul>",
            "Tools Used": "React, JavaScript, HTML, CSS, AXE DevTools, NVDA, JAWS, Chrome DevTools, Visual Studio Code, JIRA"
        },
        {
            "Project Name": "FL ACCESS",
            "Role": "FRONT END DEVELOPER - Deloitte",
            "Time Period": "2023 - PRESENT",
            "Description": "FL ACCESS comprehensive platform facilitating access to social services including CalFresh, Medi-Cal, CalWORKs, enabling users to apply, renew benefits, and manage case information.",
            "Responsibilities": "<ul><li>Delivered 40+ user stories, fixed 15+ critical bugs, and ensured accessibility compliance (ADA, NVDA, AXE).</li><li>Contributed to major module (RMB & RAC) stabilization—managed SIT readiness and closed 40+ validation tickets.</li><li>Facilitated onboarding by mentoring and providing knowledge-transfer sessions to new developers.</li><li><strong>Recognition:</strong> Deloitte SPOT and APPLAUSE awards for key contributions to demos, accessibility, and quality delivery.</li></ul>",
            "Tools Used": "React, JavaScript, HTML, CSS, PostgreSQL, AXE DevTools, NVDA, FIGMA, Visual Studio Code, SourceTree, Postman, Lambda Test"
        },
        {
            "Project Name": "Other Key Projects",
            "Role": "FRONT END DEVELOPER - Deloitte",
            "Time Period": "2021 - 2024",
            "Description": "Additional significant projects demonstrating versatility across multiple state implementations and healthcare platforms.",
            "Responsibilities": "<ul><li>Delivered 80+ UI screens with backend integration and fixed 50+ bugs, ensuring full accessibility compliance (ADA, NVDA, AXE).</li><li>Played a key role in stabilizing RMB and RAC modules by managing SIT readiness and closing 40+ validation tickets.</li><li>Led a module pod to timely completion and resolution, supporting successful project delivery.</li><li>Mentored and onboarded new developers through targeted knowledge-transfer sessions, promoting team growth and collaboration.</li></ul>",
            "Tools Used": "React, JavaScript, HTML, CSS, PostgreSQL, Redux, Visual Studio Code, SourceTree, JIRA, FIGMA, DBeaver, SoapUI"
        }
    ],
    "Skills": [
        {
            "title": "Frontend Development",
            "skills": [
                {
                    "name": "React JS",
                    "level": "Skilled"
                },
                {
                    "name": "React Redux",
                    "level": "Intermediate"
                },
                {
                    "name": "React Routers",
                    "level": "Intermediate"
                },
                {
                    "name": "Prime React",
                    "level": "Skilled"
                },
                {
                    "name": "HTML 5",
                    "level": "Skilled"
                },
                {
                    "name": "CSS 3",
                    "level": "Skilled"
                },
                {
                    "name": "Bootstrap",
                    "level": "Skilled"
                },
                {
                    "name": "Tailwind CSS",
                    "level": "Skilled"
                },
                {
                    "name": "JavaScript",
                    "level": "Skilled"
                },
                {
                    "name": "PostgreSQL",
                    "level": "Intermediate"
                },
                {
                    "name": "OracleDB",
                    "level": "Intermediate"
                }
            ]
        },
        {
            "title": "Testing",
            "skills": [
                {
                    "name": "Functional Testing",
                    "level": "Skilled"
                },
                {
                    "name": "JIRA",
                    "level": "Skilled"
                },
                {
                    "name": "JAWS",
                    "level": "Skilled"
                },
                {
                    "name": "NVDA",
                    "level": "Skilled"
                },
                {
                    "name": "Waves",
                    "level": "Basic"
                },
                {
                    "name": "SoapUI",
                    "level": "Intermediate"
                }
            ]
        },
        {
            "title": "Other",
            "skills": [
                {
                    "name": "VSCode",
                    "level": "Skilled"
                },
                {
                    "name": "Sourcetree",
                    "level": "Skilled"
                },
                {
                    "name": "Git",
                    "level": "Intermediate"
                },
                {
                    "name": "GitHub",
                    "level": "Intermediate"
                },
                {
                    "name": "Postman",
                    "level": "Intermediate"
                },
                {
                    "name": "Figma",
                    "level": "Basic"
                }
            ]
        }
    ],
    "Achievements": [
        {
            "title": "Deloitte APPLAUSE Award (Michigan & SCCP)",
            "description": "Received APPLAUSE AWARD for exceptional teamwork and technical support across Michigan and SC-CP project teams, demonstrating adaptability and technical excellence."
        },
        {
            "title": "SC-CP SPOT Award",
            "description": "Awarded SCCP SPOT AWARD for adaptability in SSP framework and rapid, high-quality UI delivery for the Appeals module, showcasing excellent problem-solving skills."
        },
        {
            "title": "Deloitte APPLAUSE Award (FL Access)",
            "description": "Received Deloitte APPLAUSE award for playing a pivotal role in achieving critical FL SSP project milestones with leadership and dedication noted by management."
        },
        {
            "title": "Deloitte SPOT Award (FL Access Demo)",
            "description": "Received Deloitte SPOT award for outstanding contribution to the successful FL Access project demo, demonstrating exceptional presentation and technical skills."
        },
        {
            "title": "Deloitte SPOT Award (Demo Project)",
            "description": "Awarded Deloitte SPOT award for developing a demo project with a user-friendly interface that contributed to the product's successful sales and client acquisition."
        }
    ],
    "Projects": [
        {
            "projectLandingPage": "/images/adititextile.png",
            "Name": "Aditi Textile",
            "description": "Developed an e-commerce platform for authentic Sambalpuri clothing using React 18. Implemented personalized recommendations, wishlist functionality, and real-time chat support. Integrated Firebase Authentication (Google Sign-In) and React Router v6 for secure and seamless user experience. Designed a responsive UI with React Icons and CSS3.",
            "Github": "https://github.com/MEDHA-21/Aditi-Textile",
            "Link": "https://adititextile.com"
        },
        {
            "projectLandingPage": "/images/otakuflix.png",
            "Name": "OtakuFlix",
            "description": "A modern, responsive anime streaming platform built with React. Real-time API-powered React anime discovery platform featuring live data from MyAnimeList, smart watchlist management, and responsive design. Built with React 18, real-time API integration, genre filtering, rating stats, and seamless anime browsing experience with trailer support and mobile-optimized interface.",
            "Github": "https://github.com/MEDHA-21/OtakuFlix",
            "Link": "https://otaku-flix.netlify.app/"
        },
        {
            "projectLandingPage": "/images/pawpals.png",
            "Name": "PawPals",
            "description": "Pet Store website crafted with HTML, CSS, Bootstrap, and JS, offering a visually appealing and user-friendly platform for pet enthusiasts.",
            "Github": "https://github.com/MEDHA-21/pawpals",
            "Link": "https://pawpals.netlify.app/"
        }
    ],
    "ContactMe": {
        "contactPara": "I'm currently looking for React Developer opportunities! If you know of any positions available, if you have any questions, or if you just want to say hi, please feel free to reach out to me at,"
    }
}